Revit 2024 API
CurveLoop.Create Method
 Creates a new curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static CurveLoop Create(
	IList<Curve> curves
)
Visual Basic
Public Shared Function Create ( _
	curves As IList(Of Curve) _
) As CurveLoop
Visual C++
public:
static CurveLoop^ Create(
	IList<Curve^>^ curves
)
Parameters
curves
Type: System.Collections.Generic.IList<Curve>
 The curves.
Return Value
 The curve loop.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curves contains at least one helical curve and is not supported for this operation. -or- Throws if the input curves are not contiguous.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace